Revit 2027 API
BuiltInFailures.ScheduleViewFailures.PanelScheduleSlotInconsistency Property
 The template applied to this panel schedule is set to display fewer slots than what is needed to display the maximum number of 1-pole breakers set on the equipment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PanelScheduleSlotInconsistency { get; }
Public Shared ReadOnly Property PanelScheduleSlotInconsistency As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PanelScheduleSlotInconsistency {
	FailureDefinitionId^ get ();
}
static member PanelScheduleSlotInconsistency : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ScheduleViewFailures Class
Autodesk.Revit.DB Namespace